In [1]:
#Import libraries
import pandas as pd
import sqlite3 as db

In [2]:
#Create connection to sqlite database
conn = db.connect('db/sqlite.db')

cursor = conn.cursor()

In [ ]:
#Create database table employees
cursor.execute("CREATE TABLE employees(employee_id INTEGER PRIMARY KEY, first_name NVARCHAR(50), last_name NVARCHAR(50), email NVARCHAR(100))")

In [13]:
#Validate if the table is successfully created
cursor.execute("SELECT name FROM sqlite_master WHERE type = 'table';")
print(cursor.fetchall())

[('employees',)]

In [ ]:
#Insert new data to employee table
cursor.execute("INSERT INTO employees VALUES (1, 'John', 'Doe', 'johndoe@johndoe.com')")
cursor.execute("INSERT INTO employees VALUES (2, 'Jason', 'Hale', 'jasonhale@jasonhale.com')")
cursor.execute("INSERT INTO employees VALUES (3, 'Jane', 'Doe', 'janedoe@janedoe.com')")

In [15]:
#Data query to check newly added entries
cursor.execute("SELECT * FROM employees;")
data = cursor.fetchall()
print(data)

[(1, 'John', 'Doe', 'johndoe@johndoe.com'), (2, 'Jason', 'Hale', 'jasonhale@jasonhale.com'), (3, 'Jane', 'Doe', 'janedoe@janedoe.com')]

In [16]:
#Add multiple data into our table
new_employees = [(4, 'Gustavo', 'Anchong', 'gustavoanchong@gustavoanchong.com'),
                 (5, 'Kim', 'Abercombie', 'kimabercrombie@kimabercombie.com'),
                 (6, 'Pilar', 'Bernard', 'pilarbernard@pilarbernard.com'),
                 (7, 'Frances', 'Adams', 'franesadams@francisadams.com'),
                 (8, 'Margaret', 'Smith', 'margaretsmith@margaretsmith.com'),
                 (9, 'Angela', 'Adams', 'angelaadams@angelaadams.com'),
                 (10, 'Samuel', 'Agcaouli', 'samuelagcaoili@samuelagcaoili.com')]

cursor.executemany('INSERT INTO employees VALUES (?, ?, ?, ?)', new_employees)

In [17]:
#Data query to check newly added entries
cursor.execute("SELECT * FROM employees;")
data = cursor.fetchall()
print(data)

[(1, 'John', 'Doe', 'johndoe@johndoe.com'), (2, 'Jason', 'Hale', 'jasonhale@jasonhale.com'), (3, 'Jane', 'Doe', 'janedoe@janedoe.com'), (4, 'Gustavo', 'Anchong', 'gustavoanchong@gustavoanchong.com'), (5, 'Kim', 'Abercombie', 'kimabercrombie@kimabercombie.com'), (6, 'Pilar', 'Bernard', 'pilarbernard@pilarbernard.com'), (7, 'Frances', 'Adams', 'franesadams@francisadams.com'), (8, 'Margaret', 'Smith', 'margaretsmith@margaretsmith.com'), (9, 'Angela', 'Adams', 'angelaadams@angelaadams.com'), (10, 'Samuel', 'Agcaouli', 'samuelagcaoili@samuelagcaoili.com')]

In [18]:
#Applies update to database
conn.commit()

In [19]:
#close connection
cursor.close()
conn.close()

In [4]:
#Establish connection and read data from database
conn = db.connect('db/sqlite.db')
data_employee = pd.read_sql_query('SELECT * FROM employees', conn)

data_employee

   employee_id first_name   last_name                              email
0            1       John         Doe                johndoe@johndoe.com
1            2      Jason        Hale            jasonhale@jasonhale.com
2            3       Jane         Doe                janedoe@janedoe.com
3            4    Gustavo     Anchong  gustavoanchong@gustavoanchong.com
4            5        Kim  Abercombie   kimabercrombie@kimabercombie.com
5            6      Pilar     Bernard      pilarbernard@pilarbernard.com
6            7    Frances       Adams       franesadams@francisadams.com
7            8   Margaret       Smith    margaretsmith@margaretsmith.com
8            9     Angela       Adams        angelaadams@angelaadams.com
9           10     Samuel    Agcaouli  samuelagcaoili@samuelagcaoili.com

In [8]:
#Close connection from database
conn.close()